           SELECT BANKDAT   ASSIGN TO "FIBUBANK.DAT"
                            ORGANIZATION INDEXED ACCESS DYNAMIC
                            RECORD KEY BK-KEY
                            FILE STATUS IS WF-STATUS.
